0xsmirk/mcu_cmsis_svd/Nuvoton/NUC100_Series.svd
       <register>
          <name>CLKSEL0</name>
          <description>Clock Source Select Control Register 0</description>
          <addressOffset>0x00000010</addressOffset>
          <access>read-write</access>
          <resetValue>0xfffffff8</resetValue>
          <resetMask>0xfffffff8</resetMask>
          <fields>
            <field>
              <name>HCLK_S</name>
              <description>HCLK clock source select (write-protection bits)
Note:
1. Before clock switching, the related clock sources (both pre-select and new-select) must be turn on
2. The 3-bit default value is reloaded from the value of CFOSC (Config0[26:24]) in user configuration register of Flash controller by any reset. Therefore the default value is either 000b or 111b.
3. These bits are protected bit, It means programming this bit needs to write &quot;59h&quot;, &quot;16h&quot;, &quot;88h&quot; to address 0x5000_0100 to disable register protection. Reference the register REGWRPROT at address GCR_BA+0x100.
000 = Clock source from external 4~24 MHz crystal clock
001 = Clock source from external 32.768 kHz crystal clock
010 = Clock source from PLL clock
011 = Clock source from internal 10 kHz oscillator clock
111 = Clock source from internal 22.1184 MHz oscillator clock
Others = reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>STCLK_S</name>
              <description>Cortex_M0 SysTick clock source select (write-protection bits)
If SYST_CSR[2]=0, SysTick uses listed clock source below
These bits are protected bit. It means programming this bit needs to write &quot;59h&quot;, &quot;16h&quot;, &quot;88h&quot; to address 0x5000_0100 to disable register protection. Reference the register REGWRPROT at address GCR_BA+0x100.
000 = clock source from 4~24 MHz crystal clock 
001 = Clock source from external 32.768 kHz crystal clock
010 = clock source from 12MHz crystal clock / 2
011 = clock source from HCLK / 2
1xx = Clock source from internal 22.1184 MHz oscillator clock / 2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>CLKSEL1</name>
          <description>Clock Source Select Control Register 1</description>
          <addressOffset>0x00000014</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>WDT_S</name>
              <description>Watchdog Timer clock source select (write-protection bits)
These bits are protected bit, program this need to write &quot;59h&quot;, &quot;16h&quot;, &quot;88h&quot; to address 0x5000_0100 to disable register protection. Reference the register REGWRPROT at address GCR_BA+0x100.
00 = Clock source from external 4~24 MHz crystal clock.
01 = Reserved
10 = Clock source from HCLK/2048 clock.
11 = Clock source from internal 10 kHz oscillator clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ADC_S</name>
              <description>ADC clock source select
00 = Clock source from external 4~24 MHz crystal clock.
01 = clock source from PLL clock
1x = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>TMR0_S</name>
              <description>TIMER0 clock source select.
000 = Clock source from external 4~24 MHz crystal clock.
001 = Clock source from external 32.768 kHz crystal clock.
010 = Clock source from HCLK.
011 = Clock source from external trigger.
1xx = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>TMR1_S</name>
              <description>TIMER1 clock source select.
000 = Clock source from external 4~24 MHz crystal clock.
001 = Clock source from external 32.768 kHz crystal clock.
010 = Clock source from HCLK.
011 = Clock source from external trigger.
1xx = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>TMR2_S</name>
              <description>TIMER2 clock source select.
000 = Clock source from external 4~24 MHz crystal clock.
001 = Clock source from external 32.768 kHz crystal clock.
010 = Clock source from HCLK.
011 = Clock source from external trigger.
1xx = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>TMR3_S</name>
              <description>TIMER3 clock source select.
000 = Clock source from external 4~24 MHz crystal clock.
001 = Clock source from external 32.768 kHz crystal clock.
010 = Clock source from HCLK.
011 = Clock source from external trigger.
1xx = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>UART_S</name>
              <description>UART clock source select.
00 = Clock source from external 4~24 MHz crystal clock.
01 = Clock source from PLL clock.
1x = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>CAN_S</name>
              <description>CAN clock source select
00 = Clock source from external 4~24 MHz crystal clock.
01 = Clock source from PLL clock.
1x = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PWM01_S</name>
              <description>PWM0 and PWM1 clock source select
PWM0 and PWM1 uses the same Engine clock source, both of them use the same prescaler.
00 = Clock source from external 4~24 MHz crystal clock.
01 = Clock source from external 32.768 kHz crystal clock.
10 = Clock source from HCLK.
11 = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PWM23_S</name>
              <description>PWM2 and PWM3 clock source select
PWM2 and PWM3 uses the same Engine clock source, both of them use the same prescaler.
00 = Clock source from external 4~24 MHz crystal clock.
01 = Clock source from external 32.768 kHz crystal clock.
10 = Clock source from HCLK.
11 = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>CLKDIV</name>
          <description>Clock Divider Number Register</description>
          <addressOffset>0x00000018</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>HCLK_N</name>
              <description>HCLK clock divide number from HCLK clock source
The HCLK clock frequency = (HCLK clock source frequency) / (HCLK_N + 1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>USB_N</name>
              <description>USB clock divide number from PLL clock
The USB clock frequency = (PLL frequency ) / (USB_N + 1)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>UART_N</name>
              <description>UART clock divide number from UART clock source
The UART clock frequency = (UART clock source frequency ) / (UART_N + 1)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>CAN_N_L</name>
              <description>CAN clock divide number from CAN clock source
The CAN clock frequency = (CAN clock source frequency ) / (CAN_N + 1)
Which CAN_N = 16 * CAN_N_H + CAN_N_L</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ADC_N</name>
              <description>ADC clock divide number from ADC clock source
The ADC clock frequency = (ADC engine clock source frequency ) / (ADC_N + 1)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>CAN_N_H</name>
              <description>CAN clock divide number from CAN clock source (Low Density Only)
The CAN clock frequency = (CAN clock source frequency ) / (CAN_N + 1)
Which CAN_N = 16 * CAN_N_H + CAN_N_L</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>CLKSEL2</name>
          <description>Clock Source Select Control Register 2</description>
          <addressOffset>0x0000001c</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>I2S_S</name>
              <description>I2S clock source select.
00 = Clock source from external 4~24 MHz crystal clock.
01 = Clock source from PLL clock.
10 = Clock source from HCLK.
11 = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>FRQDIV_S</name>
              <description>Clock Divider Clock Source Select.
00 = Clock source from external 4~24 MHz crystal clock.
01 = Clock source from external 32.768 kHz crystal clock.
10 = Clock source from HCLK.
11 = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PWM45_S</name>
              <description>PWM4 and PWM5 Clock Source Select.(Medium Density Only)
PWM4 and PWM5 used the same Engine clock source, both of them use the same prescaler.
00 = Clock source from external 4~24 MHz crystal clock.
01 = Clock source from external 32.768 kHz crystal clock.
10 = Clock source from HCLK.
11 = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PWM67_S</name>
              <description>PWM6 and PWM7 Clock Source Select.(Medium Density Only)
PWM6 and PWM7 used the same Engine clock source, both of them use the same prescaler.
00 = Clock source from external 4~24 MHz crystal clock.
01 = Clock source from external 32.768 kHz crystal clock.
10 = Clock source from HCLK.
11 = Clock source from internal 22.1184 MHz oscillator clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
