0xsmirk/mcu_cmsis_svd/Nuvoton/NUC100_Series.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FMC</name>
      <description>Registers group</description>
      <groupName>FMC</groupName>
      <baseAddress>0x5000c000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0000001c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>ISPCON</name>
          <description>ISP Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>ISPEN</name>
              <description>ISP Enable
ISP function enable bit. Set this bit to enable ISP function.
1 = Enable ISP function
0 = Disable ISP function</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>BS</name>
              <description>Boot Select 
Set/clear this bit to select next booting from LDROM/APROM, respectively. This bit also functions as chip booting status flag, which can be used to check where chip booted from. This bit is initiated with the inversed value of CBS in Config0 after power-on reset; It keeps the same value at other reset.
1 = boot from LDROM
0 = boot from APROM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>CFGUEN</name>
              <description>Enable Config-bits Update by ISP
LDROM update enable bit. 
1 = Enable ISP can update config-bits.
0 = Disable ISP can update config-bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>LDUEN</name>
              <description>LDROM Update Enable
LDROM update enable bit. 
1 = LDROM can be updated when the MCU runs in APROM.
0 = LDROM can not be updated</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ISPFF</name>
              <description>ISP Fail Flag
This bit is set by hardware when a triggered ISP meets any of the following conditions:
(1) APROM writes to itself.
(2) LDROM writes to itself. 
(3) CONFIG is erased/programmed if CFGUEN is set to 0.
(4) Destination address is illegal, such as over an available range.
Write 1 to clear.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PT</name>
              <description>Flash Program Time
PT[2]	PT[1]	PT[0]	Program Time (us)	
0	0	0	40	
0	0	1	45	
0	1	0	50	
0	1	1	55	
1	0	0	20	
1	0	1	25	
1	1	0	30	
1	1	1	35	</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>ET</name>
              <description>Flash Erase Time
ET[2]	ET[1]	ET[0]	Erase Time (ms)	
0	0	0	20 (default)	
0	0	1	25	
0	1	0	30	
0	1	1	35	
1	0	0	3	
1	0	1	5	
1	1	0	10	
1	1	1	15	</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>ISPADR</name>
          <description>ISP Address Register</description>
          <addressOffset>0x00000004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>ISPADR</name>
              <description>ISP Address 
NuMicro(TM) NUC100 Series equips with a maximum 32Kx32 embedded flash, it supports word program only. ISPARD[1:0] must be kept 00b for ISP operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>ISPDAT</name>
          <description>ISP Data Register</description>
          <addressOffset>0x00000008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>ISPDAT</name>
              <description>ISP Data 
Write data to this register before ISP program operation
Read data from this register after ISP read operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>ISPCMD</name>
          <description>ISP Command Register</description>
          <addressOffset>0x0000000c</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>FCTRL</name>
              <description>ISP Command 
ISP command table is showed below:
Operation Mode	FOEN	FCEN	FCTRL[3:0]	
Read	0	0	0	0	0	0	
Program	1	0	0	0	0	1	
Page Erase	1	0	0	0	1	0	</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>FCEN</name>
              <description>ISP Command 
ISP command table is showed below:
Operation Mode	FOEN	FCEN	FCTRL[3:0]	
Read	0	0	0	0	0	0	
Program	1	0	0	0	0	1	
Page Erase	1	0	0	0	1	0	</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>FOEN</name>
              <description>ISP Command 
ISP command table is showed below:
Operation Mode	FOEN	FCEN	FCTRL[3:0]	
Read	0	0	0	0	0	0	
Program	1	0	0	0	0	1	
Page Erase	1	0	0	0	1	0	</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>ISPTRG</name>
          <description>ISP Trigger Control Register</description>
          <addressOffset>0x00000010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>ISPGO</name>
              <description>ISP start trigger
Write 1 to start ISP operation and this bit will be cleared to 0 by hardware automatically when ISP operation is finished.
1 = ISP is on going
0 = ISP is operation is finished</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>DFBADR</name>
          <description>Data Flash Base Address Register</description>
          <addressOffset>0x00000014</addressOffset>
          <access>read-only</access>
          <resetValue>0x0001f000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>DFBADR</name>
              <description>Data Flash Base Address
This register indicates data flash start address. It is a read only register.
For 128kB flash memory device, the data flash size is defined by user configuration, register content is loaded from Config1 when chip power on but for 64/32kB device, it is fixed at 0x01_f000 </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>FATCON</name>
          <description>Flash Access Time Control Register</description>
          <addressOffset>0x00000018</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>FPSEN</name>
              <description>Flash Power Save Enable
If CPU clock is slower than 24 MHz, then s/w can enable flash power saving function. 
1 = Enable flash power saving
0 = Disable flash power saving</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>FATS</name>
              <description>Flash Access Time Window Select
These bits are used to decide flash sense amplifier active duration.



FATS	Access Time window (ns)	
000	40	
001	50	
010	60	
011	70	
100	80	
101	90	
110	100	
111	reserved	</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
