0xsmirk/mcu_cmsis_svd/Nuvoton/NUC100_Series.svd
       <register>
          <name>GPD_MFP</name>
          <description>GPIOD multiple function and input type control register</description>
          <addressOffset>0x0000003c</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>GPD_MFP0</name>
              <description>PD.0 Pin Function Selection (Medium Density Only)
1 = The SPI2 SS20 function is selected to the pin PD.0
0 = The GPIOD[0] is selected to the pin PD.0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP1</name>
              <description>PD.1 Pin Function Selection
For NUC100/NUC120/NUC130/NUC140 Medium Density
1 = The SPI2 SPICLK function is selected to the pin PD.1
0 = The GPIOD[1] is selected to the pin PD.1
For NUC100/NUC120/NUC130/NUC140 Low Density and NUC101 LQFP48 package
Reserved
For NUC101 QFN36 package
1 = The SPI0 SS01 function is selected to the pin PD.1
0 = The GPIOD[1] is selected to the pin PD.1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP2</name>
              <description>PD.2 Pin Function Selection
For NUC100/NUC120/NUC130/NUC140 Medium Density
1 = The SPI2 MISO0 (master input, slave output pin-0) function is selected to the pin PD.2
0 = The GPIOD[2] is selected to the pin PD.2
For NUC100/NUC120/NUC130/NUC140 Low Density and NUC101 LQFP48 package
Reserved
For NUC101 QFN36 package
1 = The SPI0 MISO1 (master input, slave output pin-1) function is selected to the pin PD.2
0 = The GPIOD[2] is selected to the pin PD.2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP3</name>
              <description>PD.3 Pin Function Selection
For NUC100/NUC120/NUC130/NUC140 Medium Density
1 = The SPI2 MOSI0 (master output, slave input pin-0) function is selected to the pin GPD3
0 = The GPIOD[3] is selected to the pin PD.3
For NUC100/NUC120/NUC130/NUC140 Low Density and NUC101 LQFP48 package
Reserved
For NUC101 QFN36 package
1 = The SPI0 MOSI1 (master output, slave input pin-1) function is selected to the pin PD.3
0 = The GPIOD[3] is selected to the pin PD.3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP4</name>
              <description>PD.4 Pin Function Selection (Medium Density Only)
1 = The SPI2 MISO1 (master input, slave output pin-1) function is selected to the pin PD.4
0 = The GPIOD[4]is selected to the pin PD.4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP5</name>
              <description>PD.5 Pin Function Selection (Medium Density Only)
1 = The SPI2 MOSI1 (master output, slave input pin-1) function is selected to the pin PD.5
0 = The GPIOD[5] is selected to the pin PD.5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP6</name>
              <description>PD.6 Pin Function Selection (Medium Density Only)
1 = The CAN0 RX function is selected to the pin PD.6
0 = The GPIOD[6] is selected to the pin PD.6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP7</name>
              <description>PD.7 Pin Function Selection (Medium Density Only)
1 = The CAN0 TX function is selected to the pin PD.7
0 = The GPIOD[7] is selected to the pin PD.7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP8</name>
              <description>PD.8 Pin Function Selection (Medium Density Only)
1 = The SPI3 SS30 function is selected to the pin PD8
0 = The GPIOD[8] is selected to the pin PD8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP9</name>
              <description>PD.9 Pin Function Selection (Medium Density Only)
1 = The SPI3 SPICLK function is selected to the pin PD.9
0 = The GPIOD-9 is selected to the pin PD.9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP10</name>
              <description>PD.10 Pin Function Selection (Medium Density Only)
1 = The SPI3 MISO0 (master input, slave output pin-0) function is selected to the pin PD.10
0 = The GPIOD[10] is selected to the pin PD.10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP11</name>
              <description>PD.11 Pin Function Selection (Medium Density Only)
1 = The SPI3 MOSI0 (master output, slave input pin-0) function is selected to the pin PD.11
0 = The GPIOD[11] is selected to the pin PD.11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP12</name>
              <description>PD.12 Pin Function Selection (Medium Density Only)
1 = The SPI3 MISO1 (master input, slave output pin-1) function is selected to the pin PD.12
0 = The GPIOD[12] is selected to the pin PD.12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP13</name>
              <description>PD.13 Pin Function Selection (Medium Density Only)
1 = The SPI3 MOSI1 (master output, slave input pin-1) function is selected to the pin PD.13
0 = The GPIOD[13] is selected to the pin PD.13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP14</name>
              <description>PD.14 Pin Function Selection (Medium Density Only)
1 = The UART2 RXD function is selected to the pin PD.14
0 = The GPIOD[14] selected to the pin PD.14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_MFP15</name>
              <description>PD.15 Pin Function Selection (Medium Density Only)
1 = The UART2 TXD function is selected to the pin PD.15
0 = The GPIOD[15] selected to the pin PD.15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPD_TYPEn</name>
              <description>1 = Enable GPIOD[15:0] I/O input Schmitt Trigger function
0 = Disable GPIOD[15:0] I/O input Schmitt Trigger function</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>GPE_MFP</name>
          <description>GPIOE multiple function and input type control register</description>
          <addressOffset>0x00000040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>GPE_MFP0</name>
              <description>PE.0 Pin Function Selection (Medium Density Only)
1 = The PWM6 function is selected to the pin PE.0
0 = The GPIOE[0] is selected to the pin PE.0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPE_MFP1</name>
              <description>PE.1 Pin Function Selection (Medium Density Only)
1 = The PWM7 function is selected to the pin PE.1
0 = The GPIOE[1] is selected to the pin PE.1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPE_MFP5</name>
              <description>PE.5 Pin Function Selection (Medium Density Only)
1 = The PWM5 function is selected to the pin PE.5
0 = The GPIOE[5] is selected to the pin PE.5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>GPE_TYPEn</name>
              <description>1 = Enable GPIOE[15:0] I/O input Schmitt Trigger function
0 = Disable GPIOE[15:0] I/O input Schmitt Trigger function
Note: In this field, Low Density only has GPE_TYPE5 bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
