0xsmirk/mcu_cmsis_svd/Nuvoton/NUC100_Series.svd
       <register>
          <name>I2CADM3</name>
          <description>I2C Slave Address Mask Register3</description>
          <addressOffset>0x00000030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>I2CADM</name>
              <description>I2C Address Mask register
1 = Mask enable (the received corresponding address bit is don't care.)
0 = Mask disable (the received corresponding register bit should be exact the same as address register.) 
I2C bus controllers support multiple address recognition with four address mask reg. When the bit in the address mask register is set to one, it means the received corresponding address bit is don't-care. If the bit is set to zero, that means the received corresponding register bit should be exact the same as address register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C1</name>
      <baseAddress>0x40120000</baseAddress>
    </peripheral>
    <peripheral>
      <name>I2S</name>
      <description>Registers group</description>
      <groupName>I2S</groupName>
      <baseAddress>0x401a0000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000018</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>I2S_CON</name>
          <description>I2S Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>I2SEN</name>
              <description>Enable I2S Controller
1 = Enable
0 = Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>TXEN</name>
              <description>Transmit Enable
1 = Enable data transmit
0 = Disable data transmit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RXEN</name>
              <description>Receive Enable
1 = Enable data receive
0 = Disable data receive</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>MUTE</name>
              <description>Transmit Mute Enable
1 = Transmit channel zero
0 = Transmit data is shifted from buffer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>WORDWIDTH</name>
              <description>Word Width
00 = data is 8 bit
01 = data is 16 bit
10 = data is 24 bit
11 = data is 32 bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>MONO</name>
              <description>Monaural Data
1 = Data is monaural format
0 = Data is stereo format</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>FORMAT</name>
              <description>Data Format
1 = MSB justified data format
0 = I2S data format</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>SLAVE</name>
              <description>Slave Mode
I2S can operate as master or slave. For master mode, I2S_BCLK and I2S_LRCLK pins are output mode and send bit clock from NuMicro(TM) NUC100 series to Audio CODEC chip. In slave mode, I2S_BCLK and I2S_LRCLK pins are input mode and I2S_BCLK and I2S_LRCLK signals are received from outer Audio CODEC chip.
1 = Slave mode
0 = Master mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>TXTH</name>
              <description>Transmit FIFO Threshold Level
If remain data word (32 bits) in transmit FIFO is the same or less than threshold level then TXTHI flag is set.
000 = 0 word data in transmit FIFO
001 = 1 word data in transmit FIFO
010 = 2 words data in transmit FIFO
011 = 3 words data in transmit FIFO
100 = 4 word data in transmit FIFO
101 = 5 word data in transmit FIFO
110 = 6 word data in transmit FIFO
111 = 7 word data in transmit FIFO</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RXTH</name>
              <description>Receive FIFO Threshold Level
When received data word(s) in buffer is equal or higher than threshold level then RXTHI flag is set.
000 = 1 word data in receive FIFO
001 = 2 word data in receive FIFO
010 = 3 word data in receive FIFO
011 = 4 word data in receive FIFO
100 = 5 word data in receive FIFO
101 = 6 word data in receive FIFO
110 = 7 word data in receive FIFO
111 = 8 word data in receive FIFO</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>MCLKEN</name>
              <description>Master Clock Enable
If NuMicro(TM) NUC100 series external crystal clock is frequency 2*N*256fs then software can program MCLK_DIV[2:0] in I2S_CLKDIV register to get 256fs clock to audio codec chip.
1 = Enable master clock
0 = Disable master clock</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RCHZCEN</name>
              <description>Right channel zero cross detect enable
If this bit is set to 1, when left channel data sign bit change or next shift data bits are all zero then RZCF flag in I2S_STATUS register is set to 1.
1 = Enable right channel zero cross detect
0 = Disable right channel zero cross detect</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>LCHZCEN</name>
              <description>Left channel zero cross detect enable
If this bit is set to 1, when left channel data sign bit change or next shift data bits are all zero then LZCF flag in I2S_STATUS register is set to 1.
1 = Enable left channel zero cross detect
0 = Disable left channel zero cross detect</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>CLR_TXFIFO</name>
              <description>Clear Transmit FIFO
Write 1 to clear transmit FIFO, internal pointer is reset to FIFO start point, and TXFIFO_LEVEL[3:0] returns to zero and transmit FIFO becomes empty but data in transmit FIFO is not changed.
This bit is clear by hardware automatically, read it return zero.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>CLR_RXFIFO</name>
              <description>Clear Receive FIFO
Write 1 to clear receive FIFO, internal pointer is reset to FIFO start point, and RXFIFO_LEVEL[3:0] returns to zero and receive FIFO becomes empty.
This bit is clear by hardware automatically, read it return zero.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>TXDMA</name>
              <description>Enable Transmit DMA
When TX DMA is enabled, I2S requests DMA to transfer data from SRAM to transmit FIFO if FIFO is not full.
1 = Enable TX DMA
0 = Disable TX DMA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RXDMA</name>
              <description>Enable Receive DMA
When RX DMA is enabled, I2S requests DMA to transfer data from receive FIFO to SRAM if FIFO is not empty.
1 = Enable RX DMA
0 = Disable RX DMA</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>I2S_CLKDIV</name>
          <description>I2S Clock Divider Register</description>
          <addressOffset>0x00000004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>MCLK_DIV</name>
              <description>Master Clock Divider
If chip external crystal frequency is (2xMCLK_DIV)*256fs then software can program these bits to generate 256fs clock frequency to audio codec chip. If MCLK_DIV is set to 0, MCLK is the same as external clock input.
For example, sampling rate is 24 kHz and chip external crystal clock is 12.288 MHz, set MCLK_DIV=1.
F_MCLK = F_I2SCLK/(2x(MCLK_DIV)) (When MCLK_DIV is &gt;= 1 )
F_MCLK = F_I2SCLK (When MCLK_DIV is set to 0 )</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>BCLK_DIV</name>
              <description>Bit Clock Divider
If I2S operates in master mode, bit clock is provided by NuMicro(TM) NUC100 series. Software can program these bits to generate sampling rate clock frequency.
F_BCLK = F_I2SCLK /(2x(BCLK_DIV + 1))</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>I2S_IE</name>
          <description>I2S Interrupt Enable Register</description>
          <addressOffset>0x00000008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>RXUDFIE</name>
              <description>Receive FIFO underflow interrupt enable
If software read receive FIFO when it is empty then RXUDF flag in I2SSTATUS register is set to 1.
1 = Enable interrupt
0 = Disable interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RXOVFIE</name>
              <description>Receive FIFO overflow interrupt enable
1 = Enable interrupt
0 = Disable interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RXTHIE</name>
              <description>Receive FIFO threshold level interrupt
When data word in receive FIFO is equal or higher then RXTH[2:0] and the RXTHI bit is set to 1. If RXTHIE bit is enabled, interrupt occur.
1 = Enable interrupt
0 = Disable interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>TXUDFIE</name>
              <description>Transmit FIFO underflow interrupt enable
Interrupt occurs if this bit is set to 1 and transmit FIFO underflow flag is set to 1.
1 = Enable interrupt
0 = Disable interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>TXOVFIE</name>
              <description>Transmit FIFO overflow interrupt enable
Interrupt occurs if this bit is set to 1 and transmit FIFO overflow flag is set to 1.
1 = Enable interrupt
0 = Disable interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>TXTHIE</name>
              <description>Transmit FIFO threshold level interrupt enable
Interrupt occurs if this bit is set to 1 and data words in transmit FIFO is less than TXTH[2:0].
1 = Enable interrupt
0 = Disable interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RZCIE</name>
              <description>Right channel zero cross interrupt enable
Interrupt occurs if this bit is set to 1 and right channel zero cross.
1 = Enable interrupt
0 = Disable interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>LZCIE</name>
              <description>Left channel zero cross interrupt enable
Interrupt occurs if this bit is set to 1 and left channel zero cross.
1 = Enable interrupt
0 = Disable interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
